# Pandas DataFrame

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Q46
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [3]:
# checking the presence of column
if 'col4' in df.columns:
    print("Col4 is present in DataFrame.")
else:
    print("Col4 is not present in DataFrame.")
if 'col1' in df.columns:
    print("Col1 is present in DataFrame.")
else:
    print("Col1 is not present in DataFrame.")

Col4 is not present in DataFrame.
Col1 is present in DataFrame.

In [4]:
#Q47
df.iloc[0, :]

col1    1
col2    4
col3    7
Name: 0, dtype: int64

In [5]:
df.iloc[3,:]

col1    4
col2    9
col3    1
Name: 3, dtype: int64

In [6]:
# Q48
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      int64
 1   col2    5 non-null      int64
 2   col3    5 non-null      int64
dtypes: int64(3)
memory usage: 248.0 bytes

In [8]:
df.dtypes

col1    int64
col2    int64
col3    int64
dtype: object

In [9]:
#Q49
df = pd.DataFrame()
d = pd.DataFrame({"col1": range(3),"col2": range(3)})
df = df.append(d)
df

   col1  col2
0     0     0
1     1     1
2     2     2

In [10]:
#Q50
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [11]:
df = df.sort_values(['attempts', 'name'], ascending=[True,True])
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
9      Jonas   19.0         1     yes
7      Laura    NaN         1      no
6    Matthew   14.5         1     yes
4      Emily    9.0         2      no
2  Katherine   16.5         2     yes
8      Kevin    8.0         2      no
1       Dima    9.0         3      no
3      James    NaN         3      no
5    Michael   20.0         3     yes

In [15]:
#Q51
df = df.fillna({'score': 0})
df.score = df.score.astype(int)
df

        name  score  attempts qualify
0  Anastasia     12         1     yes
9      Jonas     19         1     yes
7      Laura      0         1      no
6    Matthew     14         1     yes
4      Emily      9         2      no
2  Katherine     16         2     yes
8      Kevin      8         2      no
1       Dima      9         3      no
3      James      0         3      no
5    Michael     20         3     yes

In [16]:
#Q52
df = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
df

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     inf
5    -inf

In [18]:
df = df.replace([np.inf, -np.inf], np.nan)
df

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

In [19]:
#Q53
d = {'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(d)
df

   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11

In [20]:
new_col = [1, 2, 3, 4, 7]  
df.insert(loc=0, column='col1', value=new_col)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [21]:
#Q54
list_l = [[2, 4], [1, 3]]
list_l

[[2, 4], [1, 3]]

In [23]:
df = pd.DataFrame(list_l, columns =['col1', 'col2'])
df

   col1  col2
0     2     4
1     1     3

In [24]:
#Q55
df = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
df

  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

In [25]:
df = df.groupby('col1')['col2'].apply(list)
df

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

In [26]:
#Q56
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(d)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [27]:
df.columns.get_loc('col2')

1

In [28]:
#57
len(df.columns)

3

In [29]:
#58
df.loc[:, df.columns!= 'col3']

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

In [30]:
#59
df.head(2)

   col1  col2  col3
0     1     4     7
1     2     5     8

In [31]:
#60
df.tail(3)

   col1  col2  col3
2     3     6    12
3     4     9     1
4     7     5    11